app/Controllers/Login.php

    public function login_user(){
        $session = session();

        if(!$this->validate([
            'username' => [
                'rules' => 'required',
                'errors'=> ['required' => 'Username Tidak Boleh Kosong!']
                ],
            'password' => [
                'rules' => 'required',
                'errors'=> ['required' => 'Password Tidak Boleh Kosong!']
            ]
        ]))
        {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $userModel = new user();

        $user = $userModel->where('username',$username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin2'
 LIMIT 1